unwireddevices/RIOT/cpu/stm32l4/include/cpu_conf.h
/*
 * Copyright (C) 2017 Freie Universität Berlin
 *               2017 Inria
 *
 * This file is subject to the terms and conditions of the GNU Lesser General
 * Public License v2.1. See the file LICENSE in the top level directory for more
 * details.
 */

/**
 * @defgroup        cpu_stm32l4 STM32L4
 * @brief           STM32L4 specific code
 * @ingroup         cpu
 * @{
 *
 * @file
 * @brief           Implementation specific CPU configuration options
 *
 * @author          Hauke Petersen <hauke.pertersen@fu-berlin.de>
 * @author          Alexandre Abadie <alexandre.abadie@inria.fr>
*/

#ifndef CPU_CONF_H
#define CPU_CONF_H

#include "cpu_conf_common.h"

#if defined(CPU_MODEL_STM32L476RG)
#include "vendor/stm32l476xx.h"
#elif defined(CPU_MODEL_STM32L475VG)
#include "vendor/stm32l475xx.h"
#elif defined(CPU_MODEL_STM32L432KC)
#include "vendor/stm32l432xx.h"
#elif defined(CPU_MODEL_STM32L451CC)
#include "vendor/stm32l451xx.h"
#elif defined(CPU_MODEL_STM32L452RE)
#include "vendor/stm32l452xx.h"
#endif



#define STM32L4_DEV_ID_CAT1                 0x435
#define STM32L4_DEV_ID_CAT2                 0x462
#define STM32L4_DEV_ID_CAT3                 0x415
#define STM32L4_DEV_ID_CAT4                 0x461


#define STM32L4_CPUID_ADDR_CAT1234          (0x1FFF7590)        

#define ST_DEV_ID                           ((DBGMCU->IDCODE) & DBGMCU_IDCODE_DEV_ID)

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @brief   ARM Cortex-M specific CPU configuration
 * @{
 */
#define CPU_DEFAULT_IRQ_PRIO            (1U)
#if defined(CPU_MODEL_STM32L432KC)
#define CPU_IRQ_NUMOF                   (83U)
#elif defined(CPU_MODEL_STM32L451CC) || defined(CPU_MODEL_STM32L452RE)
#define CPU_IRQ_NUMOF                   (85U)
#else
#define CPU_IRQ_NUMOF                   (82U)
#endif
/** @} */


/**
 * @brief Switch to MSI clock
 * @param[in] msi_range MSI frequency range
 * @param[in] ahb_divider AHB bus divider
 */
void switch_to_msi(uint32_t msi_range, uint32_t ahb_divider);

/**
 * @brief   Initizliaze clocks (switch to default clock)
 */
void clk_init(void);

/**
 * @brief   Determine CPU RAM size
 * @return  RAM size in bytes
 */
uint32_t get_cpu_ram_size(void);

/**
 * @brief   Determine CPU flash size
 * @return  Flash size in bytes
 */
uint32_t get_cpu_flash_size(void);

/**
 * @brief   Determine CPU EEPROM size
 * @return  EEPROM size in bytes
 */
uint32_t get_cpu_eeprom_size(void);

/**
 * @brief   Determine CPU Category size
 * @return  CPU category according to RM0038 Reference Manual
 */
uint32_t get_cpu_category(void);

/**
 * @brief   Determine CPU RAM size
 * @param[out]  name Pointer to char array to store CPU name
 * @return  0 on success
 */
uint32_t get_cpu_name(char *name);

#ifdef __cplusplus
}
#endif

#endif /* CPU_CONF_H */
/** @} */
